[
    {
        "employer": "Lloyds Banking Group",
        "role": "Kotlin Developer",
        "start_date": "9/24",
        "end_date": "*today*",
        "data": [
            "Delivering bimonthly UI features for the flagship Scottish Widows app in close collaborations with Designers and Feature Engineers. My team are all so great, I love working with them",
            "Coordinated with multiple teams to implement a bespoke solution for coverage metrics for commits saving 5 minutes per PR",
            "Not much else, I just started..."
        ]
    },
    {
        "employer": "Northcoders Group",
        "role": "Full-stack Developer",
        "start_date": "2/23",
        "end_date": "5/23",
        "data": [
            "Lead engineer for Flutter app under Agile. TypeScript and Supabase postgress on the back",
            "Architected postgress solutions using Docker to provide a standardised container for teams",
            "Recipient of the \"Most Productive Dev\" award"
        ]
    },
    {
        "employer": "RSM UK",
        "role": "Equity Analyst",
        "start_date": "8/22",
        "end_date": "02/23",
        "data": [
            "Lead analyst for creating client sales data pipelines that funneled into managerial dashboards using Alteryx and PowerBI",
            "Automated Excel with VBA to minimise repetition with formal recognition for my automation efforts",
            "Small team of 10 required expert interpersonal skills to gel well with the team and produce top work",
            "Balancing work with ACA exams without skipping a beat exemplifies my high-capacity bandwidth"
        ]
    },
    {
        "employer": "WebEssence",
        "role": "Full-stack WebDev",
        "start_date": "2021",
        "end_date": "22",
        "data": [
            "Product design leader for our low-cost no-maintainance website solutions",
            "We designed full stack CRUD apps utilising static hosting in the front end and no-cost headless content management systems on the backend making the product perfect for small businesses",
            "Targeted small businesses with low mutability needs and no desire for ongoing maintainence. We used GitHub static hosting using the content management system to hydrate the page."
        ]
    }
]
